In [102]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [103]:
dataset = pd.read_csv("Bengaluru_House_Data.csv")

In [104]:
dataset.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

# DATA CLEANING

    * counting each values in the column

In [105]:
dataset['area_type'].value_counts()

area_type
Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: count, dtype: int64

    * Drop some unwanted columns

In [106]:
dataset.drop(['area_type','availability','society','balcony'],axis=1,inplace=True)

In [107]:
dataset.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

    * Checking for NaN values

In [108]:
print(dataset.isnull().sum())

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

#### If we want to fill the null value we can use the <span style="color: yellow;">_datsaet.fillna()_</span> method if we want to fill with the specific values such as mean, median the we can use <span style="color: yellow;">_dataset.fillna(dataset.mean())_</span> or <span style="color: yellow;">_dataset.fillna(dataset.meian())_</span> and other specific values such as 0 then <span style="color: yellow;">_dataset.fillna(0)_</span> and using forward and backward filling <span style="color: yellow;">_dataset.ffill()_</span> for forward filling and <span style="color: yellow;">_dataset.bfill()_</span> for backward filling or else we can simply drop the Null rows using <span style="color: yellow;">_dataset.dropna()_</span>

In [109]:
## remove the null value

df2 = dataset.dropna()

In [110]:
df2.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [111]:
df2.head(10)

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00
5                Whitefield      2 BHK       1170   2.0   38.00
6          Old Airport Road      4 BHK       2732   4.0  204.00
7              Rajaji Nagar      4 BHK       3300   4.0  600.00
8              Marathahalli      3 BHK       1310   3.0   63.25
9              Gandhi Bazar  6 Bedroom       1020   6.0  370.00

In [112]:
## size column more convenient to read by creating new column name BHK 
df2['BHK']=df2['size'].apply(lambda x: x.split(' ')[0]).astype(int)

C:\Users\rsibr\AppData\Local\Temp\ipykernel_5492\334706766.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['BHK']=df2['size'].apply(lambda x: x.split(' ')[0]).astype(int)

In [113]:
## Find the unique values
df2['BHK'].unique()

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18])

In [114]:
## Access the dataset which has the BHK value greater than 20
df2[df2.BHK>20]

                       location        size total_sqft  bath  price  BHK
1718  2Electronic City Phase II      27 BHK       8000  27.0  230.0   27
4684                Munnekollal  43 Bedroom       2400  40.0  660.0   43

In [115]:
## '43 Bedroom 2400' for 43 bedrooms total_sqft is 2400 it is impossible so we going to handle these type of problem

df2['total_sqft'].unique() ## There are ranges in the total_sqft columns

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [116]:
def is_float(X):
    try:
        float(X)
        #float(df2.iloc[1,2])
    except:
        return False
        #float(df2.iloc[30,2])
    return True



df2[~df2['total_sqft'].apply(is_float)].head(10)

               location       size      total_sqft  bath    price  BHK
30            Yelahanka      4 BHK     2100 - 2850   4.0  186.000    4
122              Hebbal      4 BHK     3067 - 8156   4.0  477.000    4
137  8th Phase JP Nagar      2 BHK     1042 - 1105   2.0   54.005    2
165            Sarjapur      2 BHK     1145 - 1340   2.0   43.490    2
188            KR Puram      2 BHK     1015 - 1540   2.0   56.800    2
410             Kengeri      1 BHK  34.46Sq. Meter   1.0   18.500    1
549         Hennur Road      2 BHK     1195 - 1440   2.0   63.770    2
648             Arekere  9 Bedroom       4125Perch   9.0  265.000    9
661           Yelahanka      2 BHK     1120 - 1145   2.0   48.130    2
672        Bettahalsoor  4 Bedroom     3090 - 5002   4.0  445.000    4

In [117]:
## Handle the ranges and NaN values

def convert_range_to_num(X):
    tokens = X.split('-')
    if len(tokens) == 2:
        return (float(tokens[0])+float(tokens[1]))/2
    try:
        return float(X)
    except:
        return None
    
df2['total_sqft'] = df2['total_sqft'].apply(convert_range_to_num)

C:\Users\rsibr\AppData\Local\Temp\ipykernel_5492\597009050.py:12: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['total_sqft'] = df2['total_sqft'].apply(convert_range_to_num)

In [122]:
df2.isnull().sum()

location       0
size           0
total_sqft    46
bath           0
price          0
BHK            0
dtype: int64

In [124]:
## drop NaN values
df3=df2.dropna()

In [127]:
df3.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
BHK           0
dtype: int64